package com.code.thread.ee.lock.utils;

public class Lock笔记 {


	/*
	 *--------------------------------------------------------------------------------------------------
	 *
	 * ForkJoin
	 *      分而治之
	 *                      ForkJoinTask <------------- 由 ForkJoinPool 操纵
	 *              _____________|_____________
	 *             |                          |
	 *       RecursiveTask              RecursiveTask
	 *
	 *--------------------------------------------------------------------------------------------------
	 */


}
